<template>
    <div
        class="modal fade"
        id="userPassportModal"
        tabindex="-1"
        aria-labelledby="userPassportModalLabel"
        aria-hidden="true">
        <div class="modal-dialog modal-xl modal-dialog-scrollable">
            <div class="modal-content">
                <div class="modal-header">
                    <h3 class="modal-title" id="userPassportModalLabel">
                        Профессиональный статус
                    </h3>
                    <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                        <span aria-hidden="true">&times;</span>
                    </button>
                </div>
                <div class="modal-body">
                    <p>
                        New Star market сохраняет все Ваши данные, в том числе и паспортные и использует их
                        исключительно в целях осуществления деятельности в рамках текущего проекта.
                    </p>
                    <p>
                        Паспортные данные не передаются третьим лицам и не используются в сторонних сервисах.
                    </p>
                    <h4>
                        Зачем надо загружать паспортные данные в New Star market.
                    </h4>
                    <ol>
                        <li>
                            Если Вы загружаете паспортные данные в систему New Star market, Вы тем самым защищаете
                            свой аккаунт от незаконного использования другими людьми.
                        </li>
                        <li>
                            Паспортные данные необходимы в случае, если вы хотите подтвердить свой профессиональный
                            статус.
                            Некоторые товары и услуги New Star market доступны только для профессионалов в определенной
                            области, например, профессиональным косметологам. Чтобы подтвердить свою квалификацию
                            необходимо загрузить документы, подтверждающие соответствующую квалификацию, а для того,
                            чтобы подтвердить, что диплом об образовании или сертификат принадлежит именно Вам,
                            необходимо загрузить скан паспорта. В этих случаях после проверки соответствия загруженных
                            документов, пользователю предоставляется специальный доступ к таким товарам и услугам.
                        </li>
                        <li>
                            Паспортные данные необходимы в случаях, когда пользователь подает заявку на перевод денежных
                            вознаграждений на своюпластиковую карту в соответствии с Партнёрской программу New Sstar
                            market.
                        </li>
                        <li>
                            При проведении выездных мероприятий, когда требуется оформление проживания в отелях, при
                            согласии пользователя, New Star market передаёт данные для предварительного бронирования
                            номеров и ускорения процесса заселения в отель.
                        </li>
                        <li>
                            При организации подарочных туристических поездок с согласия Партнёра New Star market
                            использует паспортные данные для оформления всех документов, необходимых для организации
                            таких туров.
                        </li>
                    </ol>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    name: "UserPassportModal"
}
</script>

<style scoped>
h3 {
    color: black;
}

p, li {
    font-size: 18px;
}
</style>
